bigbass1997/PIC-CNT64/firmware/p18lf47k42.inc
;----- IOCEF Bits -----------------------------------------------------
IOCEF3           EQU  H'0003'


;----- PPSLOCK Bits -----------------------------------------------------
PPSLOCKED        EQU  H'0000'


;----- DMA2BUF Bits -----------------------------------------------------
BUF0             EQU  H'0000'
BUF1             EQU  H'0001'
BUF2             EQU  H'0002'
BUF3             EQU  H'0003'
BUF4             EQU  H'0004'
BUF5             EQU  H'0005'
BUF6             EQU  H'0006'
BUF7             EQU  H'0007'


DMA2BUF0         EQU  H'0000'
DMA2BUF1         EQU  H'0001'
DMA2BUF2         EQU  H'0002'
DMA2BUF3         EQU  H'0003'
DMA2BUF4         EQU  H'0004'
DMA2BUF5         EQU  H'0005'
DMA2BUF6         EQU  H'0006'
DMA2BUF7         EQU  H'0007'


;----- DMA2DCNTL Bits -----------------------------------------------------
DCNT0            EQU  H'0000'
DCNT1            EQU  H'0001'
DCNT2            EQU  H'0002'
DCNT3            EQU  H'0003'
DCNT4            EQU  H'0004'
DCNT5            EQU  H'0005'
DCNT6            EQU  H'0006'
DCNT7            EQU  H'0007'


DMA2DCNT0        EQU  H'0000'
DMA2DCNT1        EQU  H'0001'
DMA2DCNT2        EQU  H'0002'
DMA2DCNT3        EQU  H'0003'
DMA2DCNT4        EQU  H'0004'
DMA2DCNT5        EQU  H'0005'
DMA2DCNT6        EQU  H'0006'
DMA2DCNT7        EQU  H'0007'


;----- DMA2DCNTH Bits -----------------------------------------------------
DCNT8            EQU  H'0000'
DCNT9            EQU  H'0001'
DCNT10           EQU  H'0002'
DCNT11           EQU  H'0003'


DMA2DCNT8        EQU  H'0000'
DMA2DCNT9        EQU  H'0001'
DMA2DCNT10       EQU  H'0002'
DMA2DCNT11       EQU  H'0003'


;----- DMA2DPTRL Bits -----------------------------------------------------
DPTR0            EQU  H'0000'
DPTR1            EQU  H'0001'
DPTR2            EQU  H'0002'
DPTR3            EQU  H'0003'
DPTR4            EQU  H'0004'
DPTR5            EQU  H'0005'
DPTR6            EQU  H'0006'
DPTR7            EQU  H'0007'


DMA2DPTR0        EQU  H'0000'
DMA2DPTR1        EQU  H'0001'
DMA2DPTR2        EQU  H'0002'
DMA2DPTR3        EQU  H'0003'
DMA2DPTR4        EQU  H'0004'
DMA2DPTR5        EQU  H'0005'
DMA2DPTR6        EQU  H'0006'
DMA2DPTR7        EQU  H'0007'


;----- DMA2DPTRH Bits -----------------------------------------------------
DPTR8            EQU  H'0000'
DPTR9            EQU  H'0001'
DPTR10           EQU  H'0002'
DPTR11           EQU  H'0003'
DPTR12           EQU  H'0004'
DPTR13           EQU  H'0005'
DPTR14           EQU  H'0006'
DPTR15           EQU  H'0007'


DMA2DPTR8        EQU  H'0000'
DMA2DPTR9        EQU  H'0001'
DMA2DPTR10       EQU  H'0002'
DMA2DPTR11       EQU  H'0003'
DMA2DPTR12       EQU  H'0004'
DMA2DPTR13       EQU  H'0005'
DMA2DPTR14       EQU  H'0006'
DMA2DPTR15       EQU  H'0007'


;----- DMA2DSZL Bits -----------------------------------------------------
DSZ0             EQU  H'0000'
DSZ1             EQU  H'0001'
DSZ2             EQU  H'0002'
DSZ3             EQU  H'0003'
DSZ4             EQU  H'0004'
DSZ5             EQU  H'0005'
DSZ6             EQU  H'0006'
DSZ7             EQU  H'0007'

DMA2DSZ0         EQU  H'0000'
DMA2DSZ1         EQU  H'0001'
DMA2DSZ2         EQU  H'0002'
DMA2DSZ3         EQU  H'0003'
DMA2DSZ4         EQU  H'0004'
DMA2DSZ5         EQU  H'0005'
DMA2DSZ6         EQU  H'0006'
DMA2DSZ7         EQU  H'0007'


;----- DMA2DSZH Bits -----------------------------------------------------
DSZ8             EQU  H'0000'
DSZ9             EQU  H'0001'
DSZ10            EQU  H'0002'
DSZ11            EQU  H'0003'

DMA2DSZ8         EQU  H'0000'
DMA2DSZ9         EQU  H'0001'
DMA2DSZ10        EQU  H'0002'
DMA2DSZ11        EQU  H'0003'


;----- DMA2DSAL Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


DMA2DSA0         EQU  H'0000'
DMA2DSA1         EQU  H'0001'
DMA2DSA2         EQU  H'0002'
DMA2DSA3         EQU  H'0003'
DMA2DSA4         EQU  H'0004'
DMA2DSA5         EQU  H'0005'
DMA2DSA6         EQU  H'0006'
DMA2DSA7         EQU  H'0007'


;----- DMA2DSAH Bits -----------------------------------------------------
DSA8             EQU  H'0000'
DSA9             EQU  H'0001'
DSA10            EQU  H'0002'
DSA11            EQU  H'0003'
DSA12            EQU  H'0004'
DSA13            EQU  H'0005'
DSA14            EQU  H'0006'
DSA15            EQU  H'0007'


DMA2DSA8         EQU  H'0000'
DMA2DSA9         EQU  H'0001'
DMA2DSA10        EQU  H'0002'
DMA2DSA11        EQU  H'0003'
DMA2DSA12        EQU  H'0004'
DMA2DSA13        EQU  H'0005'
DMA2DSA14        EQU  H'0006'
DMA2DSA15        EQU  H'0007'


;----- DMA2SCNTL Bits -----------------------------------------------------
SCNT0            EQU  H'0000'
SCNT1            EQU  H'0001'
SCNT2            EQU  H'0002'
SCNT3            EQU  H'0003'
SCNT4            EQU  H'0004'
SCNT5            EQU  H'0005'
SCNT6            EQU  H'0006'
SCNT7            EQU  H'0007'


DMA2SCNT0        EQU  H'0000'
DMA2SCNT1        EQU  H'0001'
DMA2SCNT2        EQU  H'0002'
DMA2SCNT3        EQU  H'0003'
DMA2SCNT4        EQU  H'0004'
DMA2SCNT5        EQU  H'0005'
DMA2SCNT6        EQU  H'0006'
DMA2SCNT7        EQU  H'0007'


;----- DMA2SCNTH Bits -----------------------------------------------------
SCNT8            EQU  H'0000'
SCNT9            EQU  H'0001'
SCNT10           EQU  H'0002'
SCNT11           EQU  H'0003'


DMA2SCNT8        EQU  H'0000'
DMA2SCNT9        EQU  H'0001'
DMA2SCNT10       EQU  H'0002'
DMA2SCNT11       EQU  H'0003'


;----- DMA2SPTRL Bits -----------------------------------------------------
SPTR0            EQU  H'0000'
SPTR1            EQU  H'0001'
SPTR2            EQU  H'0002'
SPTR3            EQU  H'0003'
SPTR4            EQU  H'0004'
SPTR5            EQU  H'0005'
SPTR6            EQU  H'0006'
SPTR7            EQU  H'0007'


DMA2SPTR0        EQU  H'0000'
DMA2SPTR1        EQU  H'0001'
DMA2SPTR2        EQU  H'0002'
DMA2SPTR3        EQU  H'0003'
DMA2SPTR4        EQU  H'0004'
DMA2SPTR5        EQU  H'0005'
DMA2SPTR6        EQU  H'0006'
DMA2SPTR7        EQU  H'0007'


