bigbass1997/PIC-CNT64/firmware/p18lf47k42.inc
;----- DMA2SPTRH Bits -----------------------------------------------------
SPTR8            EQU  H'0000'
SPTR9            EQU  H'0001'
SPTR10           EQU  H'0002'
SPTR11           EQU  H'0003'
SPTR12           EQU  H'0004'
SPTR13           EQU  H'0005'
SPTR14           EQU  H'0006'
SPTR15           EQU  H'0007'


DMA2SPTR8        EQU  H'0000'
DMA2SPTR9        EQU  H'0001'
DMA2SPTR10       EQU  H'0002'
DMA2SPTR11       EQU  H'0003'
DMA2SPTR12       EQU  H'0004'
DMA2SPTR13       EQU  H'0005'
DMA2SPTR14       EQU  H'0006'
DMA2SPTR15       EQU  H'0007'


;----- DMA2SPTRU Bits -----------------------------------------------------
SPTR16           EQU  H'0000'
SPTR17           EQU  H'0001'
SPTR18           EQU  H'0002'
SPTR19           EQU  H'0003'
SPTR20           EQU  H'0004'
SPTR21           EQU  H'0005'


DMA2SPTR16       EQU  H'0000'
DMA2SPTR17       EQU  H'0001'
DMA2SPTR18       EQU  H'0002'
DMA2SPTR19       EQU  H'0003'
DMA2SPTR20       EQU  H'0004'
DMA2SPTR21       EQU  H'0005'


;----- DMA2SSZL Bits -----------------------------------------------------
SSZ0             EQU  H'0000'
SSZ1             EQU  H'0001'
SSZ2             EQU  H'0002'
SSZ3             EQU  H'0003'
SSZ4             EQU  H'0004'
SSZ5             EQU  H'0005'
SSZ6             EQU  H'0006'
SSZ7             EQU  H'0007'

DMA2SSZ0         EQU  H'0000'
DMA2SSZ1         EQU  H'0001'
DMA2SSZ2         EQU  H'0002'
DMA2SSZ3         EQU  H'0003'
DMA2SSZ4         EQU  H'0004'
DMA2SSZ5         EQU  H'0005'
DMA2SSZ6         EQU  H'0006'
DMA2SSZ7         EQU  H'0007'


;----- DMA2SSZH Bits -----------------------------------------------------
SSZ8             EQU  H'0000'
SSZ9             EQU  H'0001'
SSZ10            EQU  H'0002'
SSZ11            EQU  H'0003'

DMA2SSZ8         EQU  H'0000'
DMA2SSZ9         EQU  H'0001'
DMA2SSZ10        EQU  H'0002'
DMA2SSZ11        EQU  H'0003'


;----- DMA2SSAL Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


DMA2SSA0         EQU  H'0000'
DMA2SSA1         EQU  H'0001'
DMA2SSA2         EQU  H'0002'
DMA2SSA3         EQU  H'0003'
DMA2SSA4         EQU  H'0004'
DMA2SSA5         EQU  H'0005'
DMA2SSA6         EQU  H'0006'
DMA2SSA7         EQU  H'0007'


;----- DMA2SSAH Bits -----------------------------------------------------
SSA8             EQU  H'0000'
SSA9             EQU  H'0001'
SSA10            EQU  H'0002'
SSA11            EQU  H'0003'
SSA12            EQU  H'0004'
SSA13            EQU  H'0005'
SSA14            EQU  H'0006'
SSA15            EQU  H'0007'


DMA2SSA8         EQU  H'0000'
DMA2SSA9         EQU  H'0001'
DMA2SSA10        EQU  H'0002'
DMA2SSA11        EQU  H'0003'
DMA2SSA12        EQU  H'0004'
DMA2SSA13        EQU  H'0005'
DMA2SSA14        EQU  H'0006'
DMA2SSA15        EQU  H'0007'


;----- DMA2SSAU Bits -----------------------------------------------------
SSA16            EQU  H'0000'
SSA17            EQU  H'0001'
SSA18            EQU  H'0002'
SSA19            EQU  H'0003'
SSA20            EQU  H'0004'
SSA21            EQU  H'0005'


DMA2SSA16        EQU  H'0000'
DMA2SSA17        EQU  H'0001'
DMA2SSA18        EQU  H'0002'
DMA2SSA19        EQU  H'0003'
DMA2SSA20        EQU  H'0004'
DMA2SSA21        EQU  H'0005'


;----- DMA2CON0 Bits -----------------------------------------------------
XIP              EQU  H'0000'
AIRQEN           EQU  H'0002'
DGO              EQU  H'0005'
SIRQEN           EQU  H'0006'
EN               EQU  H'0007'

DMA2XIP          EQU  H'0000'
DMA2AIRQEN       EQU  H'0002'
DMA2DGO          EQU  H'0005'
DMA2SIRQEN       EQU  H'0006'
DMA2EN           EQU  H'0007'


;----- DMA2CON1 Bits -----------------------------------------------------
SSTP             EQU  H'0000'
DSTP             EQU  H'0005'


;----- DMA2AIRQ Bits -----------------------------------------------------
AIRQ0            EQU  H'0000'
AIRQ1            EQU  H'0001'
AIRQ2            EQU  H'0002'
AIRQ3            EQU  H'0003'
AIRQ4            EQU  H'0004'
AIRQ5            EQU  H'0005'
AIRQ6            EQU  H'0006'

DMA2AIRQ0        EQU  H'0000'
DMA2AIRQ1        EQU  H'0001'
DMA2AIRQ2        EQU  H'0002'
DMA2AIRQ3        EQU  H'0003'
DMA2AIRQ4        EQU  H'0004'
DMA2AIRQ5        EQU  H'0005'
DMA2AIRQ6        EQU  H'0006'


;----- DMA2SIRQ Bits -----------------------------------------------------
SIRQ0            EQU  H'0000'
SIRQ1            EQU  H'0001'
SIRQ2            EQU  H'0002'
SIRQ3            EQU  H'0003'
SIRQ4            EQU  H'0004'
SIRQ5            EQU  H'0005'
SIRQ6            EQU  H'0006'

DMA2SIRQ0        EQU  H'0000'
DMA2SIRQ1        EQU  H'0001'
DMA2SIRQ2        EQU  H'0002'
DMA2SIRQ3        EQU  H'0003'
DMA2SIRQ4        EQU  H'0004'
DMA2SIRQ5        EQU  H'0005'
DMA2SIRQ6        EQU  H'0006'


;----- DMA1BUF Bits -----------------------------------------------------
BUF0             EQU  H'0000'
BUF1             EQU  H'0001'
BUF2             EQU  H'0002'
BUF3             EQU  H'0003'
BUF4             EQU  H'0004'
BUF5             EQU  H'0005'
BUF6             EQU  H'0006'
BUF7             EQU  H'0007'


DMA1BUF0         EQU  H'0000'
DMA1BUF1         EQU  H'0001'
DMA1BUF2         EQU  H'0002'
DMA1BUF3         EQU  H'0003'
DMA1BUF4         EQU  H'0004'
DMA1BUF5         EQU  H'0005'
DMA1BUF6         EQU  H'0006'
DMA1BUF7         EQU  H'0007'


;----- DMA1DCNTL Bits -----------------------------------------------------
DCNT0            EQU  H'0000'
DCNT1            EQU  H'0001'
DCNT2            EQU  H'0002'
DCNT3            EQU  H'0003'
DCNT4            EQU  H'0004'
DCNT5            EQU  H'0005'
DCNT6            EQU  H'0006'
DCNT7            EQU  H'0007'


DMA1DCNT0        EQU  H'0000'
DMA1DCNT1        EQU  H'0001'
DMA1DCNT2        EQU  H'0002'
DMA1DCNT3        EQU  H'0003'
DMA1DCNT4        EQU  H'0004'
DMA1DCNT5        EQU  H'0005'
DMA1DCNT6        EQU  H'0006'
DMA1DCNT7        EQU  H'0007'


;----- DMA1DCNTH Bits -----------------------------------------------------
DCNT8            EQU  H'0000'
DCNT9            EQU  H'0001'
DCNT10           EQU  H'0002'
DCNT11           EQU  H'0003'


DMA1DCNT8        EQU  H'0000'
DMA1DCNT9        EQU  H'0001'
DMA1DCNT10       EQU  H'0002'
DMA1DCNT11       EQU  H'0003'


;----- DMA1DPTRL Bits -----------------------------------------------------
DPTR0            EQU  H'0000'
DPTR1            EQU  H'0001'
DPTR2            EQU  H'0002'
DPTR3            EQU  H'0003'
DPTR4            EQU  H'0004'
DPTR5            EQU  H'0005'
DPTR6            EQU  H'0006'
DPTR7            EQU  H'0007'


DMA1DPTR0        EQU  H'0000'
DMA1DPTR1        EQU  H'0001'
DMA1DPTR2        EQU  H'0002'
DMA1DPTR3        EQU  H'0003'
DMA1DPTR4        EQU  H'0004'
DMA1DPTR5        EQU  H'0005'
DMA1DPTR6        EQU  H'0006'
DMA1DPTR7        EQU  H'0007'


;----- DMA1DPTRH Bits -----------------------------------------------------
DPTR8            EQU  H'0000'
DPTR9            EQU  H'0001'
DPTR10           EQU  H'0002'
DPTR11           EQU  H'0003'
DPTR12           EQU  H'0004'
DPTR13           EQU  H'0005'
DPTR14           EQU  H'0006'
DPTR15           EQU  H'0007'


DMA1DPTR8        EQU  H'0000'
DMA1DPTR9        EQU  H'0001'
DMA1DPTR10       EQU  H'0002'
DMA1DPTR11       EQU  H'0003'
DMA1DPTR12       EQU  H'0004'
DMA1DPTR13       EQU  H'0005'
DMA1DPTR14       EQU  H'0006'
DMA1DPTR15       EQU  H'0007'


;----- DMA1DSZL Bits -----------------------------------------------------
DSZ0             EQU  H'0000'
DSZ1             EQU  H'0001'
DSZ2             EQU  H'0002'
DSZ3             EQU  H'0003'
DSZ4             EQU  H'0004'
DSZ5             EQU  H'0005'
DSZ6             EQU  H'0006'
DSZ7             EQU  H'0007'

DMA1DSZ0         EQU  H'0000'
DMA1DSZ1         EQU  H'0001'
DMA1DSZ2         EQU  H'0002'
DMA1DSZ3         EQU  H'0003'
DMA1DSZ4         EQU  H'0004'
DMA1DSZ5         EQU  H'0005'
DMA1DSZ6         EQU  H'0006'
DMA1DSZ7         EQU  H'0007'


;----- DMA1DSZH Bits -----------------------------------------------------
DSZ8             EQU  H'0000'
DSZ9             EQU  H'0001'
DSZ10            EQU  H'0002'
DSZ11            EQU  H'0003'

DMA1DSZ8         EQU  H'0000'
DMA1DSZ9         EQU  H'0001'
DMA1DSZ10        EQU  H'0002'
DMA1DSZ11        EQU  H'0003'


